{ 
	"windowTitle": "Manual",
	"backBtnText": "Back",
	"nextBtnText": "Next",
	"pg0": "Welcome to AutoFPCurator! This guide will show you how to optimally use AutoFPCurator to speed up the curation process and how to utilize its useful features. Click Next to begin.",
	"pg1": "When you first open AutoFPCurator, you are granted with a welcome message. <b>Read it.</b> Like it says, this tool is designed for a very specific purpose (that purpose being curating multiple single-asset Flash games quickly).",
	"pg2": "First, before beginning your first curation with AutoFPCurator, let's go into Preferences. This is where some of the most important tools for speeding up the curation resides.",
	"pg3": "In the General tab, you can set the language, as well as when the program checks for updates (in case you're annoyed by the updater showing up).",
	"pg4": "But before beginning your first curation, you MUST go to the Paths tab and choose where working curations and zipped curations are stored. We'll look at the Curation tab later.",
	"pg5": "To begin, follow the instructions on the welcome screen: Go to File > Open and open an SWF file. Once you open it, AutoFPCurator should switch to the \"curation view\",  which has two tabs at the top. It also adds the \"Curation\" tab at the top of the window, which has a handful of useful utilities that are self-explanatory. Let's focus on the <b>Main</b> tab for now. Here's how the Main tab works:<br><br>By default, it will prompt you for every field of the curation's metadata except for: Platform, Application Path, Additional Applications, Curation Notes and Mount Parameters.<br><br>Once you press enter, it first validates your input to reduce the margin of error (i.e. if you put in an invalid url for the Launch Command, it won't let you continue). Once you press enter, it will not prompt you for that field again. If you do make an error regardless (like making a typo for the title), you can switch to the <b>Meta.yaml</b> tab to correct the error.<br><br>Once you've filled out all the necessary fields for the curation, it will (by default) prompt you to zip the curation (after which it will automatically close the curation).<br><br>Once the Launch Command field is filled out, AutoFPCurator makes the folders as necessary and opens the game.",
	"pg6": "For the logo, it will (by default) prompt you to take a screenshot of the window WITH THE LOGO. If you accept, it will open an image cropper. For the screenshot, it will do the same thing (without the image cropper of course) and will automatically save the screenshot inside the curation folder.",
	"pg7": "But what if multiple or all the games you're curating have one field in common, and it's counterproductive to have to input that field in every time? Or perhaps a certain field is just unnecessary to prompt for? That's where the Curation tab (from the Preferences window) comes in.<br><br>In the Curation tab, you can toggle which fields that AutoFPCurator prompts for and its default replacement (if the field is not prompted). It will not let you toggle the prompts unless you provide a <b>valid</b> replacement in the text field. So, for example, if you input an invalid date according to the YYYY-MM-DD format, it won't let you disable the Release Date prompt.<br><br>Here's a potential application of this feature:<br><br>Suppose you are curating a handful of games which share a common publisher and do not have marked release dates. In the Curation tab, you can input the default value for the Publisher field and toggle the checkbox, then toggle the \"Ask for Release Date\" checkbox."
}