{
	"windowTitle": "Manual",
	"backBtnText": "Atrás",
	"nextBtnText": "Siguiente",
	"pg0": "¡Bienvenido a AutoFPCurator! Esta guía te mostrará cómo utilizar de manera óptima AutoFPCurator para acelerar el proceso de curación y aprovechar sus características útiles. Haz clic en Siguiente para comenzar.",
	"pg1": "Cuando abras AutoFPCurator por primera vez, verás un mensaje de bienvenida. <b>Léelo.</b> Como dice, esta herramienta está diseñada para un propósito muy específico (que es curar rápidamente múltiples juegos Flash de un solo activo).",
	"pg2": "Antes de comenzar tu primera curación con AutoFPCurator, vamos a ir a Preferencias. Aquí es donde se encuentran algunas de las herramientas más importantes para acelerar la curación.",
	"pg3": "En la pestaña General, puedes configurar el idioma, así como cuándo el programa verifica las actualizaciones (en caso de que te moleste que aparezca el actualizador).",
	"pg4": "Pero antes de comenzar tu primera curación, DEBES ir a la pestaña Rutas y elegir dónde se almacenarán las curaciones en proceso y las curaciones comprimidas. Miraremos la pestaña Curación más adelante.",
	"pg5": "Para comenzar, sigue las instrucciones en la pantalla de bienvenida: Ve a Archivo > Abrir y abre un archivo SWF. Una vez que lo abras, AutoFPCurator debería cambiar a la \"vista de curación\", que tiene dos pestañas en la parte superior. También agrega la pestaña \"Curación\" en la parte superior de la ventana, que tiene varias utilidades útiles y autoexplicativas. Por ahora, centrémonos en la pestaña <b>Principal</b>. Así es como funciona la pestaña Principal:<br><br>De forma predeterminada, te solicitará todos los campos de los metadatos de la curación, excepto: Plataforma, Ruta de la aplicación, Aplicaciones adicionales, Notas de la curación y Parámetros de montaje.<br><br>Una vez que presiones Enter, primero validará tu entrada para reducir el margen de error (por ejemplo, si ingresas una URL no válida para el Comando de inicio, no te permitirá continuar). Una vez que presiones Enter, no te solicitará ese campo nuevamente. Si cometes un error de todos modos (como escribir mal el título), puedes cambiar a la pestaña <b>Meta.yaml</b> para corregir el error.<br><br>Una vez que hayas completado todos los campos necesarios para la curación, (por defecto) te solicitará comprimir la curación (después de lo cual cerrará automáticamente la curación).<br><br>Una vez que se complete el campo Comando de inicio, AutoFPCurator creará las carpetas necesarias y abrirá el juego.",
	"pg6": "Para el logotipo, (por defecto) te solicitará tomar una captura de pantalla de la ventana CON EL LOGOTIPO. Si aceptas, se abrirá un recortador de imágenes. Para la captura de pantalla, hará lo mismo (sin el recortador de imágenes, por supuesto) y guardará automáticamente la captura de pantalla dentro de la carpeta de la curación.",
	"pg7": "Pero, ¿qué sucede si varios o todos los juegos que estás curando tienen un campo en común y es contraproducente tener que ingresar ese campo cada vez? ¿O tal vez un campo en particular simplemente no es necesario solicitarlo? Ahí es donde entra en juego la pestaña Curación (desde la ventana de Preferencias).<br><br>En la pestaña Curación, puedes alternar qué campos solicita AutoFPCurator y su reemplazo predeterminado (si el campo no se solicita). No te permitirá alternar las solicitudes a menos que proporciones un valor <b>válido</b> de reemplazo en el campo de texto. Por ejemplo, si ingresas una fecha no válida según el formato AAAA-MM-DD, no te permitirá desactivar la solicitud de Fecha de lanzamiento.<br><br>Aquí hay una posible aplicación de esta función:<br><br>Supongamos que estás curando un puñado de juegos que comparten un editor común y no tienen fechas de lanzamiento marcadas. En la pestaña Curación, puedes ingresar el valor predeterminado para el campo Editor y activar la casilla de verificación, luego activar la casilla de verificación \"Preguntar por Fecha de lanzamiento\"."
}